{"keras_version": "1.2.0", "config": [{"config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-11-2888f0e330b3>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_2", "batch_input_shape": [null, 64, 100, 3], "arguments": {}, "output_shape": null, "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "nb_col": 3, "name": "convolution2d_5", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 8, "init": "he_normal", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_5", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "nb_col": 3, "name": "convolution2d_6", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "init": "he_normal", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_6", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "nb_col": 3, "name": "convolution2d_7", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "init": "he_normal", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_7", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "nb_col": 3, "name": "convolution2d_8", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "init": "he_normal", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_11"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_8", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "nb_col": 3, "name": "convolution2d_9", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 128, "init": "he_normal", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_12"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_9", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "name": "dense_5", "output_dim": 128, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 768, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_13"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_6", "output_dim": 64, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 128, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_14"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_7", "output_dim": 16, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": 64, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_15"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_8", "output_dim": 1, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": 16, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}